<template>
  <uni-popup ref="popup" background-color="#fff">
    <view class="popup-content">
      <div class="content">
        <div class="top">
          <h3>报名系统服务协议</h3>
          <h3>2021-12-04</h3>
        </div>
        <div>
          <div>① 不涉及费用的活动，报名系统不收取任何服务费，完全免费使用。</div>
          <div>② 涉及费用的活动，微信支付手续费（交易额0.6%收取）由微信官方正常收取。</div>
          <div>③ 提现极速到账；</div>

          <div>1. 服务协议的确认和接纳</div>
          <div>a. 用户使用报名系统的相关行为，都将被视为已无条件接受本声明所涉及的全部内容；若用户对本声明的任何条款有异议，请停止使用报名系统所提供的全部服务。</div>
          <div>b. 当用户使用报名系统的服务时，需遵守中国的法律法规并保证信息的真实性，同时应当恪守以下承诺：</div>
          <div>1) 用户只有在同意遵守相关法律法规和本协议时，才有权使用报名系统的服务，无论用户是否有意访问或使用此服务。</div>
          <div>2) 如果用户不同意报名系统对协议相关条款的修改，则有权停止使用服务。如果继续使用服务，则视为已接受报名系统最新服务协议条款。</div>
          <div>3) 若用户提交任何违法或者报名系统认为不适合在其平台上展示的资料，报名系统 则有理由怀疑用户的资料属于恶意操作，并且有权暂停或终止用户的账号。</div>
          <div>4) 报名系统仅对用户填写的信息与内容进行形式审查，不进行实质性审查（实质性审查包括但不限于鉴别、核实任何登记资料和活动内容的真实性、正确性以及是否为最新资料的审查）对此所产生的纠纷报名系统不承担任何过错和责任，也没有予以协调的义务。</div>
          <div>5) 用户有保证其信息和资料详尽、准确并对其及进行时更改的义务。</div>

          <div>2. 用户使用规则</div>
          <div>a. 用户有义务保管好个人微信账号的相关信息并对以其进行的所有行为负法律责任。用户不应将其账号、密码转让或借予他人使用。因黑客行为或用户的保管疏忽导致账号、密码外泄，报名系统不承担任何责任。</div>
          <div>b. 用户在使用报名系统的服务时，须向报名系统提供真实资料并及时更新。报名系统会根据用户的权限设置对用户资料的信息进行保密。</div>
          <div>c. 用户同意接受报名系统通过微信服务通知、订阅消息通知、短信或其他方式向用户发送活动通知及其相关信息。</div>
          <div>d. 根据有关法律法规，报名系统在此郑重提醒用户：任何经由本服务发布的文字、图片信息，无论是公开还是私密发布，均需由报名系统工作人员进行审核。报名系统仅为用户提供活动发布平台，无法控制经由本服务发布的活动现场情况，因此不保证活动是否符合用户的预期。但报名系统有权依法停止发布任何不符合平台规则的内容并采取相应措施，包括但不限于暂停用户使用本服务，保存有关记录，并向有关机构报告。</div>
          <div>e. 用户保证对其通过报名系统服务发布的内容拥有完整的合法的知识产权，保证报名系统使用该内容不违反国家的法律法规，也不侵犯第三方的合法权益或承担任何义务。用户承诺上传的内容不涉及侵犯他人著作权、商标、名誉、隐私及其他一切违法内容。用户应对其所提供内容因形式、内容及授权的不完善、不合法所造成的一切后果承担完全责任。</div>
          <div>f. 用户承诺遵循中华人民共和国有关互联网使用以及金融支付的的法律法规，不从事洗钱、诈骗、以及其他任何破坏社会主义经济秩序的活动；用户使用本服务的行为若有任何违反国家法律法规或侵犯第三方的合法权益时，报名系统将保留向公安机关以及国家有关监管部门举报的权利。</div>
          <div>g. 用户在使用报名系统服务期间，本协议将保持完整的效力。如果用户所发布的活动与法律相抵触或者不符合本协议，报名系统可以在不发出任何通知的情况下，随时终止用户的注册用户资格。</div>

          <div>3. 隐私保护</div>
          <div>a. 报名系统在用户使用其服务时可能获取的信息：</div>
          <div>1) openid信息：当用户使用报名系统的服务时，微信会将一个openid（字符串形式）传送到报名系统服务器上，以便储存用户的偏好设定，从而提供更好的服务。</div>
          <div>2) 日志信息：当用户使用报名系统的服务时，其服务器会自动记录用户浏览器所传送的信息。服务器日志包含用户的请求、传送请求的日期和时间等。</div>
          <div>3) 用户在报名过程中填写的信息：报名系统会根据隐私权政策对用户填写的所有报名信息进行保密，除下述条款3b描述需要披露的情况之外，皆不对任何第三方披露。</div>
          <div>b. 用户的个人信息将在下述情况下部分或全部被披露：</div>
          <div>1) 经用户同意，向第三方披露；</div>
          <div>2) 根据有关法律规定，或应行政、司法机构的要求，向第三方或者行政、司法机构披露；</div>
          <div>3) 如果用户出现违反中国有关法律或者政策的情况，需要向第三方披露；</div>
          <div>4) 为提供用户所要求的商品和服务，而必须和第三方分享用户的个人信息（不包括填表信息）；</div>
          <div>5) 其他报名系统根据法律或者国家政策认为必要的披露。</div>

          <div>4. 服务内容介绍</div>
          <div>a. 网络信息服务：指活动主办方根据本协议的规定使用报名系统发布活动信息、作为主办方和参与者确认票种交易信息、用户参加报名系统的有关活动以及其他由报名系统同意提供的信息服务。</div>
          <div>b. 报名系统平台群发信息服务：指报名系统平台为商业提供的活动推广和通知邀请等服务。</div>
          <div>c. 发布报名活动收费：</div>
          <div>1) 对于发布免费活动、聚会或未使用收款功能的用户，提供完全免费的基础服务。</div>
          <div>2) 对于使用收款功能的用户，在报名系统内产生的付费报名订单，将按报名系统申请的微信支付商户费率（0.6%）收取交易服务费。</div>
          <div>3) 活动发起人了解并同意，对于每笔交易款项的具体数额可在报名系统平台中看到。</div>
          <div>4) 在活动结束后，活动发起人可通过报名系统发起提现申请：</div>
          <div>A. 若选择提现，则将申请的对应额度交易款项转移至活动发起人的个人零钱账户或者银行卡。</div>
          <div>5) 因款项的支付、结算等所有工作由第三方支付公司完成，故具体规则以第三方支付公司的规定为准，如因国家政策发生变化或第三方支付公司调整规则时，报名系统将会对相关事宜的变更情况发出公告。</div>
          <div>d. 其他服务：包括但不限于商业推广、广告等服务，由协议方在补充协议中确定。用户在此同意报名系统在任何情况下都无需向其或第三方在传播过程中的不准确或疏漏而导致的损害承担赔偿责任。</div>

          <div>5. 知识产权</div>
          <div>a. 报名系统提供的服务中所包含的任何文字、图片资料均受相关知识产权法律的保护，未经相关权利人同意，上述资料均不得在任何渠道改写或发布。报名系统不对上述资料产生过程中的不准确予以赔偿并负责。</div>
          <div>b. 本服务的相关软件含有受法律保护的专有保密资料。未经报名系统或广告商明示授权，用户不得修改、兜售、散布本服务或软件的任何部分。用户同意将通过由报名系统所提供的界面而非任何其它途径使用本服务。</div>
          <div>c. 用户在报名系统发布的内容应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益，用户同意授予报名系统所有上述内容在全球范围内的免费、不可撤销的的使用权许可，据该许可报名系统将有权以展示、推广及其他不为我国法律所禁止的方式使用前述内容。</div>

          <div>6.  禁止发布的内容</div>
          <div>请用户谨慎选择发布在报名系统平台的信息，根据相关法律法规，任何组织和个人都不得利用报名系统发布以下内容：</div>
          <div>a. 反对宪法所确定的基本原则的；</div>
          <div>b. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</div>
          <div>c. 损害国家荣誉和利益的；</div>
          <div>d. 煽动民族仇恨、民族歧视，破坏民族团结的；</div>
          <div>e. 破坏国家宗教政策，宣扬邪教和封建迷信的；</div>
          <div>f. 散布谣言，扰乱社会秩序，破坏社会稳定的；</div>
          <div>g. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</div>
          <div>h. 侮辱或者诽谤他人，侵害他人合法权益的；</div>
          <div>i. 含有法律、行政法规禁止的其他内容的信息。</div>
          <div>如果用户知道任何人违反上述规定，请直接联系报名系统客服。报名系统不对任何用户提供的资料承担责任。</div>

          <div>7. 风险与免责</div>
          <div>用户通过本系统与广告商或其他第三方进行任何形式的通讯或商业往来，或参与活动，包含相关服务的付款，以及达成的其它任何条款，完全为用户与广告商或其他第三方之间之行为。用户因前述任何交易或前述广告商及其他第三方而遭受的任何性质的损失或损害，报名系统对此不负任何法律责任。</div>
          <div>a. 基于互联网的开放性和社交网络服务的传播特殊性，报名系统特别提醒用户谨慎注意以下风险：</div>
          <div>1) 本服务仅提供在线活动管理平台，用户应当对其他用户使用本服务所发布的内容进行独立判断并承担相应风险，用户了解并确认，报名系统不对本服务用户之间的纠纷包括交易承担任何责任。</div>
          <div>2) 用户在使用本服务过程中所发布的内容有可能会被第三方修改或做其他用途，脱离用户的预期和控制，用户必须充分意识此类风险的存在，报名系统对由此产生的纠纷不予负责。</div>
          <div>3) 请用户切勿在使用本服务时透露任何涉及财产、本服务相关账号及密码等重要信息，否则，由此带来的损失由用户自行承担。</div>
          <div>b. 以下情况使您无法使用各项服务时，报名系统所属公司不承担任何损害赔偿责任，该状况包括但不限于：</div>
          <div>1) 由于用户将微信用户密码告知他人或与他人共享注册帐户，由此导致的任何个人信息的泄漏，或其他非因报名系统原因导致的个人信息的泄漏；</div>
          <div>2) 任何由于政府管制而造成的暂时性系统关闭；</div>
          <div>3) 因不可抗力导致的任何后果；</div>
          <div>4) 因本公司公告之后系统停机维护期间；</div>
          <div>5) 因黑客攻击、电信部门技术调整或故障、系统升级、银行、第三方支付工具方面的问题等原因而造成的服务中断或者延迟。</div>
          <div>c. 本协议适用中华人民共和国的法律，所有的争端将诉诸报名系统所在地的人民法院。</div>

          <div>8.  协议变更、服务变更、中断或终止</div>
          <div>a. 本服务条款可由报名系统根据需要随时更新，且毋须另行通知。如果用户不同意相关变更，必须停止使用“服务”。登录或继续使用“服务”将表示用户接受经修订的协议。</div>
          <div>b. 鉴于服务的特殊性，用户同意报名系统有权随时变更、中断或终止服务。如变更、中断或终止的服务属于免费服务，报名系统无需通知用户，也无需对任何用户或任何第三方承担任何责任。</div>
          <div>c. 用户理解报名系统需要定期或不定期地对提供服务的平台或相关设备进行维护，如因此类情况而造成收费服务在合理时间内的中断，报名系统无需为此承担任何责任，报名系统会尽可能事先进行通告。</div>
          <div>d. 如发生下列任何一种情形，报名系统有权随时中断或终止向用户提供本协议项下的服务（包括收费服务）且无需对用户或任何第三方承担任何责任：</div>
          <div>1) 用户提供的内容和资料不真实；</div>
          <div>2) 用户违反本协议中规定的使用规则；</div>
          <div>3) 用户在使用收费服务时未按规定向报名系统支付相应的服务费。</div>
          <div>e. 用户同意报名系统基于自行考虑，因任何理由，包含但不限于缺乏使用，或认为用户已经违反本使用协议，终止用户的账号或本服务的使用，并将用户在本服务内任何内容加以移除。用户同意依本使用协议提供的服务，无需进行事先通知即可中断或终止。报名系统对用户或任何第三人均不承担任何责任。</div>
          <div>9. 适用的法律和管辖权</div>
          <div>a. 用户同意遵守中华人民共和国相关法律法规的所有规定，并对其在使用本服务过程中产生的结果承担全部责任。同时如果报名系统有理由认为用户有违反国家法律法规法人行为，报名系统可在任何时候不经事先通知终止向用户提供服务。</div>
          <div>b. 用户因本协议产生的争议，均应依照中华人民共和国法律予以处理，并由报名系统所在地的人民法院提起诉讼。</div>

          <div>10.  其他</div>
          <div>a. 若用户对本声明的任何条款有异议，请停止使用报名系统所提供的全部服务。报名系统修改条款时不再另行通知用户，如果用户继续使用服务，则视为用户接受报名系统最新服务协议条款。</div>
          <div>b. 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</div>
          <div>c. 若用户和报名系统之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，用户同意将纠纷或争议提交报名系统所在地的人民法院管辖。</div>
          <div>d. 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</div>
          <div>e. 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</div>
          <div>f. 本服务协议的最终解释权归报名系统所属公司所有。</div>

        </div>
        <div>
          <h3>14科技</h3>
          <h3>2021年12月4日</h3>
        </div>
      </div>
    </view>
  </uni-popup>
</template>
<script setup lang="ts">
import { ref, getCurrentInstance } from 'vue'
import type { ComponentInternalInstance  } from 'vue'

const type = ref('center')

const instance = getCurrentInstance() as ComponentInternalInstance

const toggle = (popupType: string) => {
  type.value = popupType
  const { refs } = instance
  // @ts-ignore
  refs.popup.open(type)
}
defineExpose({
  toggle
})
</script>
<style scoped lang="scss">
.popup-content{
  height: 70vh;
  width: 80vw;
  overflow-y: scroll;
  .content{
    padding: 5px;
    line-height: 1.5;
    .top{
      text-align: center;
    }
  }
}
</style>